; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v7 - type_1 ?v6 - type_3)
 	      (pred_1 ?v1 - object ?v6 - type_3)
	      (pred_3 ?v7 - type_1 ?v5 - type_2)
	      (pred_2 ?v7 - type_1 ?v1 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v4 ?v8 - type_3)
       :precondition (and  (pred_4 ?v7 ?v4))
       :effect (and  (pred_4 ?v7 ?v8)
		     (not (pred_4 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_1 ?v2 - object ?v3 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v3) (pred_4 ?v7 ?v3) (pred_3 ?v7 ?v5))
       :effect (and (pred_2 ?v7 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v3)) 
		    (not (pred_3 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_1 ?v2 - object ?v3 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v2 ?v5) (pred_4 ?v7 ?v3))
       :effect (and (pred_1 ?v2 ?v3)
		    (pred_3 ?v7 ?v5)
		    (not (pred_2 ?v7 ?v2 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_06 - type_1
obj_10 obj_09 obj_03 obj_07 - type_2
obj_13 obj_11 obj_02 obj_08 - type_3
obj_05 obj_04 obj_12 - object)
(:init
(pred_4 obj_01 obj_13)
(pred_3 obj_01 obj_10)
(pred_3 obj_01 obj_09)
(pred_4 obj_06 obj_11)
(pred_3 obj_06 obj_03)
(pred_3 obj_06 obj_07)
(pred_1 obj_05 obj_02)
(pred_1 obj_04 obj_11)
(pred_1 obj_12 obj_11)
)
(:goal
(and
(pred_1 obj_05 obj_02)
(pred_1 obj_04 obj_13)
(pred_1 obj_12 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_01 obj_13) (pred_4 obj_06 obj_13))))
  )
)
)

; plan
1. (op_3 obj_06 obj_04 obj_11 obj_07)
   deleted: (pred_1 obj_04 obj_11) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_04 obj_07)
   goals met: 2 of 3
2. (op_1 obj_01 obj_13 obj_11)
   deleted: (pred_4 obj_01 obj_13)
   added: (pred_4 obj_01 obj_11)
   goals met: 2 of 3
3. (op_1 obj_06 obj_11 obj_13)
   deleted: (pred_4 obj_06 obj_11)
   added: (pred_4 obj_06 obj_13)
   goals met: 2 of 3
4. (op_2 obj_06 obj_04 obj_13 obj_07)
   deleted: (pred_2 obj_06 obj_04 obj_07)
   added: (pred_1 obj_04 obj_13) (pred_3 obj_06 obj_07)
   goals met: 3 of 3
